---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.BoundaryConditions
source: html/668da92c-5286-ffca-a807-fbaec7e6cbe5.htm
---
# BoundaryConditions Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.